$(document).ready(function() {
	
  
});

$('.btn').click(function() {
          	guess();
          	measurecharactor();
}); 
 
const guess = () =>{
	let text= $('.inp').val();
    let arr=text.split("");
   if(text==''){
      alert('手机号不能为空');
   }else{
      if(!(/^1[34578](\d{9})$/.test(text))&&(arr.length<=11)){ 
             alert("您输入的手机号码有误，请重新输入");  
       }else{
       	  showResult();
       	  soothsaying();
       	  getSum();
       } 
    }
}
const soothsaying = () =>{
    let num3=getShuli();
    switch(num3){
    	
        case 1:
	        $('.p2').html('大展鸿图，信用得固，名利双收，可获成功。');
	        $('.p6').html('诗云：天地开泰万事成，身体康安亦富荣，否泰名誉兼享福，一生无忧乐绵长。');
	        $('.star').html('★★★★★★'); 
	        $('.star1').html('☆');
	        $('.p7').html('顺风满帆而容易有所成就，易取富贵人生。');
	        $('.p4').html('号码价值评估：￥405.00'); 
	        $('.p5').html('(吉)'); 
	        $('.paraph').html('宇宙起源，天地开泰之太极首领数');
	        $('.tail').html('(大吉)');
	        break;
        case 2:
	        $('.p2').html('根基不固，摇摇欲坠，一盛一衰，劳而无获。');
	        $('.p6').html('诗云：混吨未定如萍动，乱离不安亦波浪，独立无力多遇困，无欲无求寿可延。');
	        $('.star').html('★★'); 
	        $('.star1').html('☆☆☆☆☆');
	        $('.p7').html('与人合伙比之独营好得多，若自己独营商则中途易受挫折。');
	        $('.p4').html('号码价值评估：￥49.80'); 
	        $('.p5').html('(凶)'); 
	        $('.paraph').html('混饨未定，进退失据之分离落败数');
	        $('.tail').html('(凶)');
            break; 
        case 3:
	        $('.p2').html('根深蒂固，蒸蒸日上，如意吉祥，百事顺遂。');
	        $('.p6').html('诗云：进取富贵又如意，智达明敏扬名威，名利寿福皆此得，前途光茫好鸿图。');
	        $('.star').html('★★★★★★'); 
	        $('.star1').html('☆');
	        $('.p7').html('外缘殊胜，容易得人之助力及予人好印象。');
	        $('.p4').html('号码价值评估：￥391.80'); 
	        $('.p5').html('(大吉) '); 
	        $('.paraph').html('混饨未定，进退失据之分离落败数');
	        $('.tail').html('(大吉) ');
	        break;
       
        case 4:
	        $('.p2').html('前途坎坷，苦难折磨，非有毅力，难望成功。');
	        $('.p6').html('诗云：溯体汹变不具整，果落枝折病难多，山空鸟飞祸惑频，苦苦之中有孝人。');
	        $('.star').html('★★'); 
	        $('.star1').html('☆☆☆☆☆');
	        $('.p7').html('营商的话还是独营的好，与人合伙久之厌烦不耐。少年读书需用心，舟至桥头直自然。');
	        $('.p4').html('号码价值评估：￥55.80'); 
	        $('.p5').html('(凶) '); 
	        $('.paraph').html('破败汹变，万事休止之放荡数');
	        $('.tail').html('(凶) ');
	        break;
        case 5:
	        $('.p2').html('阴阳和合，生意兴隆，名利双收，后福重重。');
	        $('.p6').html('诗云：福禄寿长阴阳和，心身健全是英豪，名利双收富荣达，乃是世上福德人。');
	        $('.star').html('★★★★★★'); 
	        $('.star1').html('☆');
	        $('.p7').html('财源特佳金钱有餘，离出生之地而往大都市求谋必得更发达。');
	        $('.p4').html('号码价值评估：￥415.80'); 
	        $('.p5').html('(吉) '); 
	        $('.paraph').html('福禄长寿之福德集门数');
	        $('.tail').html('(大吉)');
	        break;
        case 6:
	        $('.p2').html('万宝集门，天降幸运，立志奋发，得成大功。');
	        $('.p6').html('诗云：安稳余庆福禄开，盛大幸福天赐来，内含衰兆应谨慎，注意品行福乐享。');
	        $('.star').html('★★★★★'); 
	        $('.star1').html('☆☆');
	        $('.p7').html('名誉良好，信用亦佳，步步高升。');
	        $('.p4').html('号码价值评估：￥276.50'); 
	        $('.p5').html('(吉) '); 
	        $('.paraph').html('安稳余庆之吉人天相数');
	        $('.tail').html('(中吉)');
	        break;
        case 7:
	        $('.p2').html('独营生意，和气吉祥，排除万难，必获成功。');
	        $('.p6').html('诗云：刚毅果断除万难，独立权威志气安，内外和好兼柔性，温和养德耀吉星。');
	        $('.star').html('★★★★★'); 
	        $('.star1').html('☆☆');
	        $('.p7').html('很勤勉求上进，又很有耐力，在技术界或艺能界，是最可能成功之数也。但此数因少得人和，而略感孤独些。');
	        $('.p4').html('号码价值评估：￥286.50'); 
	        $('.p5').html('(吉) '); 
	        $('.paraph').html('刚毅果断之勇往直前之全般整理进取数');
	        $('.tail').html('(中吉)');
	        break;
        case 8:
	        $('.p2').html('努力发达，贯彻志望，不忘进退，可望成功。');
	        $('.p6').html('诗云：意志坚刚善恶明，富进取心求和平，忍耐克己如心意，前难后成可安然。');
	        $('.star').html('★★★★★'); 
	        $('.star1').html('☆☆');
	        $('.p7').html('很勤勉求上进，又很有耐力，在技术界或艺能界，是最可能成功之数也。但此数因少得人和，而略感孤独些。');
	        $('.p4').html('号码价值评估：￥286.50'); 
	        $('.p5').html('(吉) '); 
	        $('.paraph').html('意志刚健之勤勉发展数');
	        $('.tail').html('(中吉)');
	        break;
        case 9:
	        $('.p2').html('虽抱奇才，有才无命，独营无力，财力难望。');
	        $('.p6').html('诗云：兴尽凶始遇困途，穷厄是非亲怙苦，海枯石烂心凉悲，无有恐怖无所惧。');
	        $('.star').html('★'); 
	        $('.star1').html('☆☆☆☆☆☆');
	        $('.p7').html('因异性而引起之纠纷困扰，失利特多，而且一生常遇逆境之折磨。家庭和顺则万事可成。切忌沉迷投机，可免贻误前程');
	        $('.p4').html('号码价值评估：￥15.30'); 
	        $('.p5').html('(凶) '); 
	        $('.paraph').html('兴尽入凶之穷乏困苦数');
	        $('.tail').html('(大凶)');
	        break;
        case 10:
	        $('.p2').html('乌云遮月，暗淡无光，空费心力，徒劳无功。');
	        $('.p6').html('诗云：万事终局万事空，逆难失意逢了忘，体弱灯暗居风破，无求所欲或复还。');
	        $('.star').html('★'); 
	        $('.star1').html('☆☆☆☆☆☆');
	        $('.p7').html('吉星甚少眷顾，且易累及他人，有浪费金钱之倾向，倒楣星君，需要注重修炼个人德行，以免因此受累。家庭和顺则可万事成。切忌沉迷投机，可免贻误前程。');
	        $('.p4').html('号码价值评估：￥19.90'); 
	        $('.p5').html('(凶) '); 
	        $('.paraph').html('万事终局之易损耗数');
	        $('.tail').html('(大凶)');
	        break;
        case 11:
	        $('.p2').html('草木逢春，枝叶沾露，稳健着实，必得人望。');
	        $('.p6').html('诗云：挽回家运矣春光，顺调发展财辉煌，温和笃实阴阳合，稳健顺调得人望。');
	        $('.star').html('★★★★★★'); 
	        $('.star1').html('☆');
	        $('.p7').html('吉星甚少眷顾，且易累及他人，有浪费金钱之倾向，倒楣星君，需要注重修炼个人德行，以免因此受累。家庭和顺则可万事成。切忌沉迷投机，可免贻误前程。');
	        $('.p4').html('号码价值评估：￥19.90'); 
	        $('.p5').html('(吉)'); 
	        $('.paraph').html('富贵荣达，稳健吉右，挽回家运之外缘殊胜数');
	        $('.tail').html('(大吉)');
	        break;
        case 12:
	        $('.p2').html('薄弱无力，孤立无援，外祥内苦，谋事难成。');
	        $('.p6').html('诗云：意志薄弱不伸长，易招失败遇厄栽，家属缘薄人孤独，安居守份保平安。');
	        $('.star').html('★★'); 
	        $('.star1').html('☆☆☆☆☆');
	        $('.p7').html('与人合伙比之独营好得多，若自己独营商则中途挫折。切忌沉迷投机，可免贻误前程。。');
	        $('.p4').html('号码价值评估：￥54.60'); 
	        $('.p5').html('(凶)'); 
	        $('.paraph').html('意志薄弱之家庭寂寞数');
	        $('.tail').html('(凶)');
	        break;
        case 13:
	        $('.p2').html('天赋吉运，能得人望，善用智慧，必获成功。');
	        $('.p6').html('诗云：智略超群博学多，善处事务亦忍和，功业成就得富荣，艺才相身乐千锺。');
	        $('.star').html('★★★★★★'); 
	        $('.star1').html('☆');
	        $('.p7').html('外缘殊胜，容易得人之助力及予人好印象。具有此数之人，男多勇敢果断，女多貌若天仙，有风流不羁(不顾时局大体)倾向，若修养不够或抑制力不强，往往因桃色事件惹来麻烦。');
	        $('.p4').html('号码价值评估：￥391.80'); 
	        $('.p5').html('(吉)'); 
	        $('.paraph').html('智略超群，博学多才之技能成功数');
	        $('.tail').html('(大吉)');
	        break;
        case 14:
	        $('.p2').html('忍得若难，必有后福，是成是败，惟靠紧毅。');
	        $('.p6').html('诗云：天涯泪落失怙恃，族家缘薄易克缘，寂寞烦闷易灾厄，独身浮沉难可栖。');
	        $('.star').html('★'); 
	        $('.star1').html('☆☆☆☆☆☆');
	        $('.p7').html('营商的话还是独营的好，与人合伙久之厌烦不耐。少年读书需用心，舟至桥头直自然。');
	        $('.p4').html('号码价值评估：￥17.30'); 
	        $('.p5').html('(凶)'); 
	        $('.paraph').html('天涯沦落之失意闷烦数');
	        $('.tail').html('(大凶)');
	        break;
        case 15:
	        $('.p2').html('谦恭做事，外得人和，大事成就，一门兴隆。');
	        $('.p6').html('诗云：福寿拱照德望高，财子寿全又温和，慈祥好善可恭敬，富贵繁荣得惠泽。');
	        $('.star').html('★★★★★★'); 
	        $('.star1').html('☆');
	        $('.p7').html('营商的话还是独营的好，与人合伙久之厌烦不耐。少年读书需用心，舟至桥头直自然。');
	        $('.p4').html('号码价值评估：￥17.30'); 
	        $('.p5').html('(吉)'); 
	        $('.paraph').html('福寿双全之立身兴家数');
	        $('.tail').html('(大吉)');
	        break;
        case 16:
	        $('.p2').html('能获众望，成就大业，名利双收，盟主四方。');
	        $('.p6').html('诗云：贵人得助天乙扶，为人之上有财富，众望所归事业成，不可贪色保安宁。');
	        $('.star').html('★★★★★★'); 
	        $('.star1').html('☆');
	        $('.p7').html('名誉良好，信用亦佳，步步高升。外缘殊胜，容易得人之助力及予人好印象。');
	        $('.p4').html('号码价值评估：￥403.80'); 
	        $('.p5').html('(吉)'); 
	        $('.paraph').html('贵人相助，兴家兴业之名利聚身数');
	        $('.tail').html('(大吉)');
	        break;
        case 17:
	        $('.p2').html('排除万难，有贵人助，把握时机，可得成功。');
	        $('.p6').html('诗云：突破万难权威高，刚性固执如英豪，须事谨慎守和平，可得大功奏业成。');
	        $('.star').html('★★★★★'); 
	        $('.star1').html('☆☆');
	        $('.p7').html('很勤勉求上进，又很有耐力，在技术界或艺能界，是最可能成功之数也。但此数因少得人和，而略感孤独些。');
	        $('.p4').html('号码价值评估：￥403.80'); 
	        $('.p5').html('(吉)'); 
	        $('.paraph').html('突破万难之刚柔兼备数 ');
	        $('.tail').html('(中吉)');
	        break;
        case 18:
	        $('.p2').html('经商做事，顺利昌隆，如能慎始，百事亨通。');
	        $('.p6').html('诗云：有志竟成事皆通，智谋发展有威望，过刚遭难咸柔德，博得名利大成功。');
	        $('.star').html('★★★★★'); 
	        $('.star1').html('☆☆');
	        $('.p7').html('很勤勉求上进，又很有耐力，在技术界或艺能界，是最可能成功之数也。但此数因少得人和，而略感孤独些。');
	        $('.p4').html('号码价值评估：￥403.80'); 
	        $('.p5').html('(吉)'); 
	        $('.paraph').html('有志竟成之内名有运数 ');
	        $('.tail').html('(中吉)');
	        break;
        case 19:
	        $('.p2').html('成功虽早，慎防亏空，内外不合，障碍重重。');
	        $('.p6').html('诗云：风云蔽月末得安，虽有智能作事难，孤困不和损近缘，远离颠倒无所失。');
	        $('.star').html('★★★★★'); 
	        $('.star1').html('☆☆');
	        $('.p7').html('因异性而引起之纠纷困扰，失利特多，而且一生常遇逆境之折磨。家庭和顺则万事可成。切忌沉迷投机，可免贻误前程');
	        $('.p4').html('号码价值评估：￥15.30'); 
	        $('.p5').html('(凶)'); 
	        $('.paraph').html('反应机敏，风云蔽月，先声夺人之厄困重来数');
	        $('.tail').html('(大凶)');
	        break;
        case 20:
	        $('.p2').html('智商志大，历尽艰难，焦心忧劳，进得两难。');
	        $('.p6').html('诗云：非业破运困害重，厄难病弱频频恐，一生难得安宁时，远离颠倒失复还。');
	        $('.star').html('★'); 
	        $('.star1').html('☆☆☆☆☆☆');
	        $('.p7').html('因异性而引起之纠纷困扰，失利特多，而且一生常遇逆境之折磨。家庭和顺则万事可成。切忌沉迷投机，可免贻误前程');
	        $('.p4').html('号码价值评估：￥17.90'); 
	        $('.p5').html('(凶)'); 
	        $('.paraph').html('实而不华，深藏不露，非业破运之祸厄不安数');
	        $('.tail').html('(大凶)');
	        break;
        case 21:
	        $('.p2').html('先历困苦，后得幸福，霜雪梅花，春来怒放。');
	        $('.p6').html('诗云：明月光照乐依依，俟如梅花待放时，兴家立业名利全，各自独立有权威。');
	        $('.star').html('★★★★★★'); 
	        $('.star1').html('☆');
	        $('.p7').html('因异性而引起之纠纷困扰，失利特多，而且一生常遇逆境之折磨。家庭和顺则万事可成。切忌沉迷投机，可免贻误前程');
	        $('.p4').html('号码价值评估：￥395.40'); 
	        $('.p5').html('(吉)'); 
	        $('.paraph').html('明月中天，质实刚健之独立权威数');
	        $('.tail').html('(大吉)');
	        break;
        case 22:
	        $('.p2').html('秋草逢霜，怀才不遇，忧愁怨苦，事不如意。');
	        $('.p6').html('诗云：秋草逢霜不如意，不平不满却难依，逆境挫折意志薄，身世凋冷心操劳。');
	        $('.star').html('★★'); 
	        $('.star1').html('☆☆☆☆☆');
	        $('.p7').html('与人合伙比之独营好得多，若自己独营商则中途挫折。中年需要注意健康，以免被疾病拖累前程。不耐寂寞。切忌沉迷投机，可免贻误前程。');
	        $('.p4').html('号码价值评估：￥50.60'); 
	        $('.p5').html('(凶)'); 
	        $('.paraph').html('秋草逢霜，两士相争之忧愁怨苦数');
	        $('.tail').html('(凶)');
	        break;
        case 23:
	        $('.p2').html('旭日升天，名显四方，渐次进展，终成大业。');
	        $('.p6').html('诗云：旭日东昇势壮富，贯彻大业万事胜，终至荣达功名显，猛虎添翼势声强。');
	        $('.star').html('★★★★★★'); 
	        $('.star1').html('☆');
	        $('.p7').html('具有此数之人，男多勇敢果断，女多貌若天仙，有风流不羁(不顾时局大体)倾向，若修养不够或抑制力不强，往往因桃色事件惹来麻烦。');
	        $('.p4').html('号码价值评估：￥379.80'); 
	        $('.p5').html('(吉)'); 
	        $('.paraph').html('旭日东升，质实刚坚之发育茂盛数');
	        $('.tail').html('(大吉)');
	        break;
        case 24:
	        $('.p2').html('绵绣前程，须靠自力，多用智谋，能奏大功。');
	        $('.p6').html('诗云：家门余庆福无疆，子孙繁荣富贵强，白手成家立大业，财源广进智谋全。');
	        $('.star').html('★★★★★★'); 
	        $('.star1').html('☆');
	        $('.p7').html('营商的话还是独营的好，与人合伙久之厌烦不耐。少年读书需用心，舟至桥头直自然。');
	        $('.p4').html('号码价值评估：￥391.80'); 
	        $('.p5').html('(吉)'); 
	        $('.paraph').html('家门余庆之金钱丰盈数 ');
	        $('.tail').html('(大吉)');
	        break;
        case 25:
        $('.p2').html('天时地利，只欠人和，讲信修睦，即可成功。');
        $('.p6').html('诗云：资性英敏有奇能，怪癖不和害前程，修身涵养与仁和，奏功获得大鸿图。');
        $('.star').html('★★★★★'); 
        $('.star1').html('☆☆');
        $('.p7').html('需要注重个人私生活，可免因桃色韵事贻误前程。');
        $('.p4').html('号码价值评估：￥276.50'); 
        $('.p5').html('(吉)'); 
        $('.paraph').html('英俊刚毅之资性聪敏数 ');
        $('.tail').html('(中吉)');
        break;
        case 26:
        $('.p2').html('波澜起伏，千变万化，凌架万难，必可成功。');
        $('.p6').html('诗云：千变万化慧悟高，历尽沧桑曲折多，离乱艰难缠身苦，凌驾万难始成功。');
        $('.star').html('★★★'); 
        $('.star1').html('☆☆☆☆');
        $('.p7').html('雄心万丈，抱负壮大，有取天下而名扬八方之可能性，但反之也可能输得何其壮烈。特别需要注意个人德行修炼，免因桃花事件影响运程。');
        $('.p4').html('号码价值评估：￥107.70'); 
        $('.p5').html('(凶)'); 
        $('.paraph').html('变怪异奇，艰难苦闷之豪侠数 ');
        $('.tail').html('(凶多于吉)');
        break;
        case 27:
        $('.p2').html('一成一败，一盛一衰，惟靠谨慎，可守成功。');
        $('.p6').html('诗云：迎新去旧无限度，批离中折亦多劳，欲望无止难满足，矫正自省终富荣。');
        $('.star').html('★★★★'); 
        $('.star1').html('☆☆☆');
        $('.p7').html('喜新厌旧，与异性交际之手段高明，是个调情专家。切忌沉迷投机，可免贻误前程。');
        $('.p4').html('号码价值评估：￥189.20'); 
        $('.p5').html('(凶带吉)'); 
        $('.paraph').html('足智多谋，欲望无止，盛衰争衡，先苦后甜数 ');
        $('.tail').html('(凶多于吉)');
        break;
        case 28:
        $('.p2').html('鱼临旱地，难逃恶运，此数大凶，不如更名。');
        $('.p6').html('诗云：自豪生离终辛苦，遭遇不安奈何渡，同巢雀散造敌城，远离颠倒善果期。');
        $('.star').html('★'); 
        $('.star1').html('☆☆☆☆☆☆');
        $('.p7').html('尤需注意安全，可免受意外之伤害。家庭和顺则可万事成。');
        $('.p4').html('号码价值评估：￥15.30'); 
        $('.p5').html('(凶)'); 
        $('.paraph').html('自豪生离，亲缘浅薄，离群独处无定数');
        $('.tail').html('(大凶)');
        break;
        case 29:
        $('.p2').html('如龙得云，青云直上，智谋奋进，才略奏功。');
        $('.p6').html('诗云：欲望难足希望高，计谋成功财力豪，猜疑嫉妒性自改，如龙乘云势运开。');
        $('.star').html('★★★★★★'); 
        $('.star1').html('☆');
        $('.p7').html('智能超人贯彻大志，富贵无比，不甘寂寞，叱吒风云之大吉数，但容易发生牢骚及贪心、欲望太多而永不知足，为其缺点。切忌沉迷投机，可免贻误前程。');
        $('.p4').html('号码价值评估：￥379.80'); 
        $('.p5').html('(吉)'); 
        $('.paraph').html('智谋兼备，欲望难足数');
        $('.tail').html('(大吉)');
        break;
        case 30:
        $('.p2').html('吉凶参半，得失相伴，投机取巧，吉凶无常。');
        $('.p6').html('诗云：绝处逢生危险多，投机浮沉受厄殃，处事细虑保安然，破釜沉舟功可成。');
        $('.star').html('★★★★'); 
        $('.star1').html('☆☆☆☆');
        $('.p7').html('切忌沉迷投机，可免贻误前程。');
        $('.p4').html('号码价值评估：￥199.60'); 
        $('.p5').html('(吉)'); 
        $('.paraph').html('一成一败，绝处逢生，吉凶相伴之浮沉多端数');
        $('.tail').html('(吉多于凶)');
        break;
        case 31:
        $('.p2').html('此数大吉，名利双收，渐进向上，大业成就。');
        $('.p6').html('诗云：智勇得志意气新，建立声誉事业兴，终到富贵福禄奏，为人领导德望高。');
        $('.star').html('★★★★★★'); 
        $('.star1').html('☆');
        $('.p7').html('顺风满帆而容易有所成就，易取富贵人生。');
        $('.p4').html('号码价值评估：￥407.40'); 
        $('.p5').html('(吉)'); 
        $('.paraph').html('智勇得志，心想事成数 ');
        $('.tail').html('(大吉)');
        break;
        case 32:
        $('.p2').html('池中之龙，风云际会，一跃上天，成功可望。');
        $('.p6').html('诗云：侥倖所得贵人扶，善捉机会有财富，认真努力向前程，家门隆昌得富荣。');
        $('.star').html('★★★★★'); 
        $('.star1').html('☆☆');
        $('.p7').html('与人合伙比之独营好得多，若自己独营商则中途易受挫折。');
        $('.p4').html('号码价值评估：￥296.50'); 
        $('.p5').html('(吉)'); 
        $('.paraph').html('权贵显达，困龙待机之意外惠泽数 ');
        $('.tail').html('(中吉)');
        break;
        case 33:
        $('.p2').html('意气用事，人和必失，如能慎始，必可昌隆。');
        $('.p6').html('诗云：家门隆昌精神爽，博得名利星月朗，权威智谋极周全，君是天下富贵翁。');
        $('.star').html('★★★★★★'); 
        $('.star1').html('☆');
        $('.p7').html('具有此数之人，男则勇敢果断，女多貌若天仙，有风流不羁(不顾时局大体)倾向，若修养不够或抑制力不强，往往因桃色事件惹来麻烦。');
        $('.p4').html('号码价值评估：￥391.80'); 
        $('.p5').html('(吉)'); 
        $('.paraph').html('家门隆昌，才德开展之威震天下数 ');
        $('.tail').html('(大吉)');
        break;
        case 34:
        $('.p2').html('灾难不绝，难望成功，此数大凶，不如更名。');
        $('.p6').html('诗云：山空鸟绝树枯老，千困百难波浪多，恰逢非星尤堪忧，能掉头时宜掉头。');
        $('.star').html('★'); 
        $('.star1').html('☆☆☆☆☆☆');
        $('.p7').html('营商的话还是独营的好，与人合伙久之厌烦不耐。少年读书需用心，舟至桥头直自然。中年需要注意健康，以免被疾病拖累前程。不耐寂寞。');
        $('.p4').html('号码价值评估：￥17.30'); 
        $('.p5').html('(吉)'); 
        $('.paraph').html('出入生死之财命难过数 ');
        $('.tail').html('(大凶)');
        break;
        case 35:
        $('.p2').html('中吉之数，进退保守，生意安稳，成就普通。');
        $('.p6').html('诗云：温和平安艺才高，努力前途福运来，文笔奇绝仁德高，务实稳健掌门人。');
        $('.star').html('★★★★★'); 
        $('.star1').html('☆☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥286.50'); 
        $('.p5').html('(吉)'); 
        $('.paraph').html('温和平静之优雅发展数  ');
        $('.tail').html('(中吉)');
        break;
        case 36:
        $('.p2').html('波澜得叠，常陷穷困，动不如静，有才无命。');
        $('.p6').html('诗云：风浪不静难得安，侠情波澜万事难，须养精神与考虑，不可自作风头儿。');
        $('.star').html('★'); 
        $('.star1').html('☆☆☆☆☆☆');
        $('.p7').html('雄心万丈，抱负壮大，有取天下而名扬八方之可能性，但反之也可能输得何其壮烈。');
        $('.p4').html('号码价值评估：￥15.30'); 
        $('.p5').html('(凶)'); 
        $('.paraph').html('风浪不息，侠义薄运，穷困厄难之倒楣多端数  ');
        $('.tail').html('(大凶)');
        break;
        case 37:
        $('.p2').html('逢凶化吉，吉人天相，风调雨顺，生意兴隆。');
        $('.p6').html('诗云：权威显达得众望，忠实热诚运极旺，大德奏功无难事，终得富荣乐千锺。');
        $('.star').html('★★★★★'); 
        $('.star1').html('☆☆');
        $('.p7').html('雄心万丈，抱负壮大，有取天下而名扬八方之可能性，但反之也可能输得何其壮烈。');
        $('.p4').html('号码价值评估：￥289.50'); 
        $('.p5').html('(吉)'); 
        $('.paraph').html('权威显达，德望成功之吉人天相数 ');
        $('.tail').html('(中吉)');
        break;
        case 38:
        $('.p2').html('名虽可得，利则难获，艺界发展，可望成功。');
        $('.p6').html('诗云：意志薄弱无威望，长于技艺得长风，名可得而利难获，贯彻努力成大功。');
        $('.star').html('★★★★★'); 
        $('.star1').html('☆☆');
        $('.p7').html('雄心万丈，抱负壮大，有取天下而名扬八方之可能性，但反之也可能输得何其壮烈。');
        $('.p4').html('号码价值评估：￥296.50'); 
        $('.p5').html('(凶带吉)'); 
        $('.paraph').html('磨铁成针，刻意经营，技艺成名之特有意义数  ');
        $('.tail').html('(中吉)');
        break;
        case 39:
        $('.p2').html('云开见月，虽有劳碌，光明坦途，指日可望。');
        $('.p6').html('诗云：富贵荣华实可当，光明荣达好儿郎，家门隆昌福万千，世代子孙个个贤。');
        $('.star').html('★★★★★★'); 
        $('.star1').html('☆');
        $('.p7').html('因异性而引起之纠纷困扰，失利特多，而且一生常遇逆境之折磨。家庭和顺则万事可成。智能超人贯彻大志，富贵无比，不甘寂寞，叱吒风云之大吉数。切忌牢骚、贪心、欲望太多、永不知足影响前程。');
        $('.p4').html('号码价值评估：￥391.80'); 
        $('.p5').html('(吉)'); 
        $('.paraph').html('富贵荣华，变化无穷之三士同盟数  ');
        $('.tail').html('(大吉)');
        break;
        case 40:
        $('.p2').html('一成一衰，沉浮不定，知难而退，自获天佑。');
        $('.p6').html('诗云：谨慎保安勿自骄，智谋胆略得显晓，知难而退获天佑，妄进逞强败涂地。');
        $('.star').html('★★★★'); 
        $('.star1').html('☆☆☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥199.60'); 
        $('.p5').html('(凶带吉)'); 
        $('.paraph').html('豪胆迈进，盛衰不定之谨慎保安数  ');
        $('.tail').html('(吉多于凶)');
        break;
        case 41:
        $('.p2').html('天赋吉运，德望兼备，继续努力，前途无限。');
        $('.p6').html('诗云：德望高大名誉振，才谋健全财源进，富贵荣华福禄至，前途洋洋得意真。');
        $('.star').html('★★★★★★'); 
        $('.star1').html('☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥199.60'); 
        $('.p5').html('(吉)'); 
        $('.paraph').html('德高望重，忠爱坚实之事事如意数 ');
        $('.tail').html('(大吉)');
        break;
        case 42:
        $('.p2').html('事业不专，十九不成，专心进取，可望成功。');
        $('.p6').html('诗云：十艺不成学艺真，博达艺能结果因，意志薄弱不取心，易于落陷心孤独。');
        $('.star').html('★★★★'); 
        $('.star1').html('☆☆☆');
        $('.p7').html('对人对事需要用心专一，以免贻误前程。');
        $('.p4').html('号码价值评估：￥189.20'); 
        $('.p5').html('(吉)'); 
        $('.paraph').html('寒婵在柳，十艺不成，意志薄弱之缺少专心数');
        $('.tail').html('(吉多于凶)');
        break;
        case 43:
        $('.p2').html('雨夜之花，外祥内苦，忍耐自重，转凶为吉。');
        $('.p6').html('诗云：雨夜之花是薄命，假虚假实影无踪，易失信用无地立，枯藤老树靠依难。');
        $('.star').html('★★★'); 
        $('.star1').html('☆☆☆☆');
        $('.p7').html('需要注重个人私生活方面的修炼，以免贻误前程。');
        $('.p4').html('号码价值评估：￥105.90'); 
        $('.p5').html('(吉带凶)'); 
        $('.paraph').html('邪途散财，外祥内苦之夸大妄想数');
        $('.tail').html('(凶多于吉)');
        break;
        case 44:
        $('.p2').html('虽用心计，事难遂愿，贪功冒进，必招失败。');
        $('.p6').html('诗云：愁眉难展破家财，暗淡辛苦悲运来，配合不宜逆境临，远离颠倒正逢时。');
        $('.star').html('★'); 
        $('.star1').html('☆☆☆☆☆☆');
        $('.p7').html('切忌沉迷投机，可免贻误前程。');
        $('.p4').html('号码价值评估：￥17.30'); 
        $('.p5').html('(凶)'); 
        $('.paraph').html('须眉难展，力量有限之悲哀续出数');
        $('.tail').html('(大凶)');
        break;
        case 45:
        $('.p2').html('杨柳遇春，绿叶发枝，冲破难关，一举成名。');
        $('.p6').html('诗云：新生泰运顺行舟，排除万难总无忧，成功繁荣四海明，荣华富贵好前程。');
        $('.star').html('★★★★★'); 
        $('.star1').html('☆☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥286.50'); 
        $('.p5').html('(吉)'); 
        $('.paraph').html('难关衝破，顺风扬帆，新生泰和之万事如意数');
        $('.tail').html('(中吉)');
        break;
        case 46:
        $('.p2').html('坎坷不平，艰难重重，若无耐心，难望有成。');
        $('.p6').html('诗云：罗网系身汹运转，一生困苦殃变多，身病孤贫可难靠，得到平安船逆风。');
        $('.star').html('★'); 
        $('.star1').html('☆☆☆☆☆☆');
        $('.p7').html('尤需注意个人安全，以免意外灾害对自己造成伤害。切忌沉迷投机，可免贻误前程。');
        $('.p4').html('号码价值评估：￥15.30'); 
        $('.p5').html('(凶)'); 
        $('.paraph').html('罗网系身之离祖成家数');
        $('.tail').html('(大凶)');
        break;
        case 47:
        $('.p2').html('有贵人助，可成大业，虽遇不幸，浮沉不定。');
        $('.p6').html('诗云：开花结子衣食足，大业奏功可庆祝，子孙繁荣多快乐，一家圆满庆有馀。');
        $('.star').html('★★★★★★'); 
        $('.star1').html('☆');
        $('.p7').html('尤需注意个人安全，以免意外灾害对自己造成伤害。切忌沉迷投机，可免贻误前程。');
        $('.p4').html('号码价值评估：￥403.80'); 
        $('.p5').html('(吉)'); 
        $('.paraph').html('点铁成金，开花结果，永显名声之权威进取数 ');
        $('.tail').html('(大吉)');
        break;
        case 48:
        $('.p2').html('美化丰实，鹤立鸡群，名利俱全，繁荣富贵。');
        $('.p6').html('诗云：有德且智德望高，堪为顾问得仁和，名利双收天赋富，威望荣达世间豪。');
        $('.star').html('★★★★★★'); 
        $('.star1').html('☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥407.40'); 
        $('.p5').html('(吉)'); 
        $('.paraph').html('青松方鹤，顾问尊敬，德智兼备之出身清贵数 ');
        $('.tail').html('(大吉)');
        break;
        case 49:
        $('.p2').html('遇吉则吉，遇凶则凶，惟靠谨慎，逢凶化吉。');
        $('.p6').html('诗云：吉凶难分运歧路，三才配置好鸿图，若逢凶星灾厄至，斜阳落夕苦难居。');
        $('.star').html('★★★★'); 
        $('.star1').html('☆☆☆');
        $('.p7').html('容易因异性而引发困扰，失利，而且一生常遇逆境之折磨。家庭和顺则万事可成。');
        $('.p4').html('号码价值评估：￥189.20'); 
        $('.p5').html('(吉)'); 
        $('.paraph').html('先吉后凶，吉凶难分之不断辛劳数 ');
        $('.tail').html('(吉多于凶)');
        break;
        case 50:
        $('.p2').html('吉凶互见，一成一败，凶中有吉，吉中有凶。');
        $('.p6').html('诗云：一成一败一瞬间，浮沉未定难得安，兴时不和平时好，败时始觉已致迟。');
        $('.star').html('★★★★'); 
        $('.star1').html('☆☆☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥191.60'); 
        $('.p5').html('(吉)'); 
        $('.paraph').html('小舟入海，一成一败，吉凶参半，须防倾覆数 ');
        $('.tail').html('(吉多于凶)');
        break;
        case 51:
        $('.p2').html('一盛一衰，浮沉不常，自重自处，可保平安。');
        $('.p6').html('诗云：盛衰交加是运期，一时声名骤离分，平生远离风波路，到老免受灾祸图。');
        $('.star').html('★★★★'); 
        $('.star1').html('☆☆☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥183.60'); 
        $('.p5').html('(吉带凶)'); 
        $('.paraph').html('盛衰交加，竭力经营之天运享受数 ');
        $('.tail').html('(吉多于凶)');
        break;
        case 52:
        $('.p2').html('草木逢春，雨过天晴，渡过难关，即获得成功。');
        $('.p6').html('诗云：先见机明察佳期，意志坚固好运时，功名利达福禄全，一世荣隆乐绵绵。');
        $('.star').html('★★★★★★'); 
        $('.star1').html('☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥391.80'); 
        $('.p5').html('(吉)'); 
        $('.paraph').html('先见之明，雨过天晴之理想实现数  ');
        $('.tail').html('(大吉)');
        break;
        case 53:
        $('.p2').html('盛衰参半，外祥内苦，先吉后凶，先凶后吉。');
        $('.p6').html('诗云：内心忧愁无人知，外盛内衰迫近期，恐防晚境心落薄，若逢幸运好护持。');
        $('.star').html('★★★★'); 
        $('.star1').html('☆☆☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥173.20'); 
        $('.p5').html('(吉带凶)'); 
        $('.paraph').html('忧愁困苦，先苦后甜之好景难长数');
        $('.tail').html('(吉多于凶)');
        break;
        case 54:
        $('.p2').html('根基不固，摇摇欲坠，一盛一衰，劳而无获。');
        $('.p6').html('诗云：内心忧愁无人知，外盛内衰迫近期，恐防晚境心落薄，若逢幸运好护持。');
        $('.star').html('★'); 
        $('.star1').html('☆☆☆☆☆☆');
        $('.p7').html('尤需注意个人安全，以免意外灾害对自己造成伤害。');
        $('.p4').html('号码价值评估：￥15.30'); 
        $('.p5').html('(凶)'); 
        $('.paraph').html('多难悲运，横灾变死之难望成功数 ');
        $('.tail').html('(大凶)');
        break;
        case 55:
        $('.p2').html('外观昌隆，内隐祸患，克服难关，开出泰运。');
        $('.p6').html('诗云：外美内苦时常悲，一面极盛一面衰，吉凶参半难以定，克服难关会运期。');
        $('.star').html('★★★★'); 
        $('.star1').html('☆☆☆');
        $('.p7').html('尤需注意个人安全，以免意外灾害对自己造成伤害。');
        $('.p4').html('号码价值评估：￥181.20'); 
        $('.p5').html('(吉带凶)'); 
        $('.paraph').html('外祥内苦，和顺不实，先苦后甘之信心成事数 ');
        $('.tail').html('(吉多于凶)');
        break;
        case 56:
        $('.p2').html('事与愿违，终难成功，欲速不达，有始无终。');
        $('.p6').html('诗云：暮日凄凉事难成，进取心薄不安然，万事龃龉精力败，低调为人保家财。');
        $('.star').html('★'); 
        $('.star1').html('☆☆☆☆☆☆');
        $('.p7').html('尤需注意个人安全，以免意外灾害对自己造成伤害。');
        $('.p4').html('号码价值评估：￥13.30'); 
        $('.p5').html('(凶)'); 
        $('.paraph').html('浪里行舟，历尽艰辛，暮日凄凉之四周障害数 ');
        $('.tail').html('(大凶)');
        break;
        case 57:
        $('.p2').html('虽有困难，时来运转，旷野枯草，春来花开。');
        $('.p6').html('诗云：寒雪青松性刚强，一度祸难过灾殃，将此发达利亨通，晚景繁荣福无疆。');
        $('.star').html('★★★★★'); 
        $('.star1').html('☆☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥276.50'); 
        $('.p5').html('(吉)'); 
        $('.paraph').html('寒雪青松之最大荣运数 ');
        $('.tail').html('(中吉)');
        break;
        case 58:
        $('.p2').html('半凶半吉，浮沉多端，始凶终吉，能保成功。');
        $('.p6').html('诗云：先苦后甘费心思，难关渡过福人扶，终逢兴隆乐余庆，恰如甘蔗好尾甘。');
        $('.star').html('★★★★★'); 
        $('.star1').html('☆☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥276.50'); 
        $('.p5').html('(凶带吉)'); 
        $('.paraph').html('晚行遇月，先苦后甘之宽宏扬名数 ');
        $('.tail').html('(中吉)');
        break;
        case 59:
        $('.p2').html('遇事猜疑，难望成事，大刀阔斧，始可有成。');
        $('.p6').html('诗云：车轮无毅不能行，失意逆境却难定，一旦厄来难伏起，果敢坚毅改前程。');
        $('.star').html('★'); 
        $('.star1').html('☆☆☆☆☆☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥15.90'); 
        $('.p5').html('(凶)'); 
        $('.paraph').html('寒婵悲风，时运不济，得亦再失之车轮无毅数');
        $('.tail').html('(大凶)');
        break;
        case 60:
        $('.p2').html('黑暗无光，心迷意乱，出尔反尔，难定方针。');
        $('.p6').html('诗云：灯微光弱步难行，苦厄刑伤事难成，体弱多病常困苦，徒加烦劳损精神。');
        $('.star').html('★'); 
        $('.star1').html('☆☆☆☆☆☆');
        $('.p7').html('吉星甚少眷顾，且易累及他人，有浪费金钱之倾向，倒楣运强，需要注重修炼个人德行，以免因此受累。');
        $('.p4').html('号码价值评估：￥18.50'); 
        $('.p5').html('(凶)'); 
        $('.paraph').html('争名夺利，暗淡无光之福禄自失数');
        $('.tail').html('(大凶)');
        break;
        case 61:
        $('.p2').html('运遮半月，内隐风波，应有谨慎，始保平安。');
        $('.p6').html('诗云：名利双收富荣达，修身养德防未燃，傲慢不逊失人和，恐有家庭起风波。');
        $('.star').html('★★★★★★'); 
        $('.star1').html('☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥447.00'); 
        $('.p5').html('(吉带凶)'); 
        $('.paraph').html('名利双收之修炼积德数 ');
        $('.tail').html('(大吉)');
        break;
        case 62:
        $('.p2').html('烦闷懊恼，事业难展，自防灾祸，始免困境。');
        $('.p6').html('诗云：基础虚弱重信用，不和衰败惹殃困，生涯苦楚因执起，步步留意保平安。');
        $('.star').html('★'); 
        $('.star1').html('☆☆☆☆☆☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥17.90'); 
        $('.p5').html('(凶)'); 
        $('.paraph').html('基础虚弱之艰难困苦数 ');
        $('.tail').html('(大凶)');
        break;
        case 63:
        $('.p2').html('万物化育，繁荣之象，专心一意，必能成功。');
        $('.p6').html('诗云：富贵荣达得显甯，子孙繁茂福绵绵，一身平安富益寿，福禄双全享千锺。');
        $('.star').html('★★★★★★'); 
        $('.star1').html('☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥395.40'); 
        $('.p5').html('(吉)'); 
        $('.paraph').html('富贵荣华，身心安泰之共同亲和数 ');
        $('.tail').html('(大吉)');
        break;
        case 64:
        $('.p2').html('见异思迁，十九不成，徒劳无功，不如更名。');
        $('.p6').html('诗云：黄鹤如风难复来，浮沉破病难平安，非业困苦叹悲愁，远离颠倒寿更长。');
        $('.star').html('★'); 
        $('.star1').html('☆☆☆☆☆☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥17.90'); 
        $('.p5').html('(凶)'); 
        $('.paraph').html('骨肉分离，孤儿悲愁，鸿运已逝之家运不幸数 ');
        $('.tail').html('(大凶)');
        break;
        case 65:
        $('.p2').html('吉运自来，能享盛名，把握时机，必获成功。');
        $('.p6').html('诗云：富贵长寿逢吉祥，家运隆昌喜气扬，福禄繁荣兼富贵，万事通达实贵重。');
        $('.star').html('★★★★★'); 
        $('.star1').html('☆☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥289.50'); 
        $('.p5').html('(吉)'); 
        $('.paraph').html('富贵长寿之光明正大数 ');
        $('.tail').html('(中吉)');
        break;
        case 66:
        $('.p2').html('黑夜温长，进退维谷，内外不和，信用缺乏。');
        $('.p6').html('诗云：内外不和不自由，进退两难总是忧，难苦虽灭艰难到，灾厄交加杯具来，心无梦想无所失。');
        $('.star').html('★'); 
        $('.star1').html('☆☆☆☆☆☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥15.90'); 
        $('.p5').html('(凶)'); 
        $('.paraph').html('内外不和之多欲失福数 ');
        $('.tail').html('(大凶)');
        break;
        case 67:
        $('.p2').html('独营事业，事事如意，功成名就，富贵自来。');
        $('.p6').html('诗云：利路享通万事成，和畅逍达四海明，家运隆盛招富贵，万商云集得繁荣。');
        $('.star').html('★★★★★★'); 
        $('.star1').html('☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥407.40'); 
        $('.p5').html('(吉)'); 
        $('.paraph').html('财路亨通，志气坚强之万商云集数 ');
        $('.tail').html('(大吉)');
        break;
        case 68:
        $('.p2').html('思虎虑周祥，计书力行，不失先机，可望成功。');
        $('.p6').html('诗云：兴家立业意志强，智虑周密名望扬，志操坚固信用重，一身才艺建基业。');
        $('.star').html('★★★★★★'); 
        $('.star1').html('☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥407.40'); 
        $('.p5').html('(吉)'); 
        $('.paraph').html('不失先机，宽容好运之兴家立业数  ');
        $('.tail').html('(大吉)');
        break;
        case 69:
        $('.p2').html('动摇不安，常陷逆境，不得时运，难得利润。');
        $('.p6').html('诗云：坐立不安如萍动，厄困事业逢波浪，废疾多病祸根至，精神意失易心狂。');
        $('.star').html('★'); 
        $('.star1').html('☆☆☆☆☆☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥15.90'); 
        $('.p5').html('(凶)'); 
        $('.paraph').html('坐立不安之处世多难数  ');
        $('.tail').html('(大凶)');
        break;
        case 70:
        $('.p2').html('惨淡经营，难免贫困，此数不吉，最好改名。');
        $('.p6').html('诗云：废物灭亡不中用，一生平淡常困贫，忧苦离乱端数异，枝折果落重难长，心无挂碍无所得。');
        $('.star').html('★'); 
        $('.star1').html('☆☆☆☆☆☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥22.50'); 
        $('.p5').html('(凶)'); 
        $('.paraph').html('废物灭亡，家运衰退之晚景凄凉数  ');
        $('.tail').html('(大凶)');
        break;
        case 71:
        $('.p2').html('吉凶参半，惟赖勇气，贯彻力行，始可成功。');
        $('.p6').html('诗云：养神耐劳得安然，修身养德计谋成，若乏实行难成事，贯彻不怠始富荣。');
        $('.star').html('★★★★'); 
        $('.star1').html('☆☆☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥230.80'); 
        $('.p5').html('(吉带凶)'); 
        $('.paraph').html('正气堂堂，毫无实质，养神耐劳之耗神而劳数 ');
        $('.tail').html('(吉大于凶)');
        break;
        case 72:
        $('.p2').html('利害混集，凶多吉少，得而复失，难以安顺。');
        $('.p6').html('诗云：未雨绸缪防未燃，外盛内衰难富乐，先苦后甘命运定，岂是人生不依强。');
        $('.star').html('★★★'); 
        $('.star1').html('☆☆☆☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥133.50'); 
        $('.p5').html('(凶)'); 
        $('.paraph').html('先甜后苦，万难艰辛之一败涂地数 ');
        $('.tail').html('(凶大于吉)');
        break;
        case 73:
        $('.p2').html('安乐自来，自然吉祥，力行不懈，终必成功。');
        $('.p6').html('诗云：志高力微乏实行，妄谋无计事难成，晚年安宁静逸祥，享得天赋增吉相。');
        $('.star').html('★★★★★'); 
        $('.star1').html('☆☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥302.50'); 
        $('.p5').html('(吉)'); 
        $('.paraph').html('志高力微之努力奋斗数 ');
        $('.tail').html('(中吉)');
        break;
        case 74:
        $('.p2').html('利不及费，坐食山空，如无章法，难望成功。');
        $('.p6').html('诗云：沉沦逆境无智能，坐吃山空难有成，落日景悲难渡日，奈何悲运悟今生，无有恐怖无所得。。');
        $('.star').html('★'); 
        $('.star1').html('☆☆☆☆☆☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥22.50'); 
        $('.p5').html('(凶)'); 
        $('.paraph').html('沉沦逆境之秋叶落寞数');
        $('.tail').html('(大凶)');
        break;
        case 75:
        $('.p2').html('吉中带凶，欲速不达，进不如守，可保安祥。');
        $('.p6').html('诗云：沉沦逆境无智能，坐吃山空难有成，落日景悲难渡日，奈何悲运悟今生，无有恐怖无所得。');
        $('.star').html('★★★★'); 
        $('.star1').html('☆☆☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥210.50'); 
        $('.p5').html('(吉带凶)'); 
        $('.paraph').html('守者可安，发迹甚迟之利害分明数');
        $('.tail').html('(吉多于凶)');
        break;
        case 76:
        $('.p2').html('此数大凶，破产之象，宜速改名，以避厄运。');
        $('.p6').html('诗云：倾覆离散居财破，内外不和难可靠，空山鸟飞愁悲叹，贫病交迫寿难延，远离颠倒宜及早。');
        $('.star').html('★'); 
        $('.star1').html('☆☆☆☆☆☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥20.50'); 
        $('.p5').html('(凶)'); 
        $('.paraph').html('倾覆离散，虽劳无功之财破落日数 ');
        $('.tail').html('(大凶)');
        break;
        case 77:
        $('.p2').html('先苦后甘，先甜后苦，如能守成，不致失败。');
        $('.p6').html('诗云：乐极生悲吉藏凶，长上馀德福禄强，前佳后劣悲叹运，中年苦劳晚年荣。');
        $('.star').html('★★★★'); 
        $('.star1').html('☆☆☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥210.00'); 
        $('.p5').html('(吉带凶)'); 
        $('.paraph').html('家庭有悦，半吉半凶，乐极生悲之多劳衰歎数  ');
        $('.tail').html('(吉多于凶)');
        break;
        case 78:
        $('.p2').html('有得有失，华而不实，须防劫财，始保安顺。');
        $('.p6').html('诗云：青年中年皆发达，壮年渐感不景气，华而不实晚运弱，心无挂碍无所失。');
        $('.star').html('★★★★'); 
        $('.star1').html('☆☆☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥210.00'); 
        $('.p5').html('(吉带凶)'); 
        $('.paraph').html('先吉后凶，壮年渐败数，晚境凄凉之功德光荣数 ');
        $('.tail').html('(吉多于凶)');
        break;
        case 79:
        $('.p2').html('如走夜路，前途无光，希望不大，劳而无功。');
        $('.p6').html('诗云：挽回乏力困善谋，精神不定如暗云，失节丧信无所止，放下我执事可成。');
        $('.star').html('★'); 
        $('.star1').html('☆☆☆☆☆☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥21.00'); 
        $('.p5').html('(凶)'); 
        $('.paraph').html('受人压制，挽回乏力之身疲力尽数 ');
        $('.tail').html('(大凶)');
        break;

        case 80:
        $('.p2').html('得而复失，枉费心机，守成无贪，可保安稳。');
        $('.p6').html('诗云：劳而无得费心机，终生困苦与劳动，障碍病难常不绝，修养善德小安康。');
        $('.star').html('★'); 
        $('.star1').html('☆☆☆☆☆☆');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥19.00'); 
        $('.p5').html('(凶)'); 
        $('.paraph').html('凶星入度，清本缩小，一生皆苦之孤独空虚数');
        $('.tail').html('(大凶)');
        break;
        case 0:
        $('.p2').html('最极之数，还本归元，能得繁荣，发达成功。');
        $('.p6').html('诗云：平步青云；贵人相助，事事顺利，家庭和睦。');
        $('.star').html('★★★★★★★'); 
        $('.star1').html('');
        $('.p7').html('');
        $('.p4').html('号码价值评估：￥1000.00'); 
        $('.p5').html('(大吉)'); 
        $('.paraph').html('平步青云；贵人相助，事事顺利，家庭和睦');
        $('.tail').html('(大吉)');
    }
} 
const showResult = () =>{
    $('.result').removeClass('hide');
    $('.wrap').addClass('hide');
    let text= $('.inp').val();
    $('.telphone').html(text);
    let num3=getShuli();
    $('.shuli').html(num3);
}
const getShuli = () =>{
    let text= $('.inp').val();
    let arr=text.split("");
    let lastfour=parseInt(text.slice(7));
    var  num  = parseInt(lastfour/80);
    var  num3 = Math.round(lastfour/80*10000)/10000;
    var  num1 = Math.round((num3-num)*10000)/10000 ;
    var  num2 = num1*80;
    return num2;
}
const getSum = ()=>{
    var text= $('.inp').val();
    var arr=text.split("");
    var count=0;
    for(var i=0;i<arr.length;i++){
      count += parseInt(arr[i]);
    }
    if(count>=10){
       var count1 = String(count);
       var arr1 = count1.split("");
       var sum = 0;
       for(var i=0;i<arr1.length;i++){
         sum += parseInt(arr1[i]);
       }
       if(sum>=10){
          var count2 = String(sum);
          var arr2 = count2.split("");
          var sum1 = 0;
          for(var i=0;i<arr2.length;i++){
            sum1 += parseInt(arr2[i]);
          }
          if(sum1>=10){
              alert('天机不可泄漏，施主请回吧！！！')
          	}else{
          	$('.factornum').html(sum1)
          }    
       }else{
        $('.factornum').html(sum)
       }
    }else{
       $('.factornum').html(count) 
    }
}
const  measurecharactor = () =>{
   n = parseInt($('.factornum').html());
   switch(n){
     case 1:
     $('.character').html('要面包不要爱情');
     $('.description').html('责任心重，尤其对工作充满热诚，是个彻头彻尾工作狂。但往往因为过分专注职务，而忽略身边的家人及朋友，是个宁要面包不需要爱情的理性主义者。');
     break;
     case 2:
     $('.character').html('不善表达/疑心重');
     $('.description').html('在乎身边各人对自己的评价及观感，不善表达个人情感，是个先考虑别人感受，再作出相应配合的内敛一族。对于爱侣，经常存有怀疑之心。');
     break;
     case 3:
     $('.character').html('大胆行事冲动派');
     $('.description').html('爱好追寻刺激，有不理后果大胆行事的倾向。崇尚自由奔放的恋爱，会拼尽全力爱一场，是就算明知无结果都在所不惜的冲动派。');
     break; 
     case 4:
     $('.character').html('高度戒备难交心');
     $('.description').html('经常处于戒备状态，对任何事都没法放松处理，孤僻性情难以交朋结友。对于爱情，就更加会慎重处理。任何人必须经过长期观察及通过连番考验，方会减除戒备与你交往。')
     break; 
     case 5:
     $('.character').html('好奇心旺求知欲强');
     $('.description').html('好奇心极度旺盛，求知欲又强，有打烂沙盘问到笃的锲而不舍精神。此外，你天生有语言天分，学习外文比一般人更易掌握。')
     break;
     case 6:
     $('.character').html('做事喜好凭直觉');
     $('.description').html('有特强的第六灵感，性格率直无机心，深得朋辈爱戴。感情路上多采多姿。做事喜好凭个人直觉及预感做决定。');
     break;
     case 7:
     $('.character').html('独断独行/吸引人');
     $('.description').html('为人独断独行，事事自行作主解决，鲜有求助他人。而这份独立个性，正正就是吸引异性的特质。但其实心底里，却是渴望有人可让他/她依赖。');
     break; 
     case 8:
     $('.character').html('热情/善变梦想家');
     $('.description').html('对人热情无遮掩，时常梦想可以谈一场戏剧性恋爱，亲身体会个中悲欢离合的动人经历，是个大梦想家。但对于感情却易变卦。');
     break; 
     case 9:
     $('.character').html('自我牺牲/性格被动');
     $('.description').html('习惯于无条件付出，从不祈求有回报，有为了成全他人不惜牺牲自己的情操。但讲到本身的爱情观，却流于被动，往往因为内敛而错过大好姻缘。');
     break;

   }
}

// var periodicChart = [ ' ','甲子','乙丑','丙寅','丁卯','戊辰','己巳','庚午','辛未','壬申','癸酉', 
// 					      '甲戌','乙亥','丙子','丁丑','戊寅','己卯','庚辰','辛巳','壬午','癸未', 
// 					      '甲申','乙酉','丙戌','丁亥','戊子','己丑','庚寅','辛卯','壬辰','癸巳', 
// 					      '甲午','乙未','丙申','丁酉','戊戌','己亥','庚子','辛丑','壬寅','癸卯', 
// 					      '甲辰','乙巳','丙午','丁未','戊申','己酉','庚戌','辛亥','壬子','癸丑',  
// 					      '甲寅','乙卯','丙辰','丁巳','戊午','己未','庚申','辛酉','壬戌','癸亥']
// var monthgzChart  = [
//                      ['丙寅','丁卯','戊辰','己巳','庚午','辛未','壬申','癸酉','甲戌','乙亥','丙子','丁丑'],
//                      ['戊寅','己卯','庚辰','辛巳','壬午','癸未','甲申','乙酉','丙戌','丁亥','戊子','己丑'],
//                      ['庚寅','辛卯','壬辰','癸巳','甲午','乙未','丙申','丁酉','戊戌','己亥','庚子','辛丑'],
//                      ['壬寅','癸卯','甲辰','乙巳','丙午','丁未','戊申','己酉','庚戌','辛亥','壬子','癸丑'],
//                      ['甲寅','乙卯','丙辰','丁巳','戊午','己未','庚申','辛酉','壬戌','癸亥','甲子','乙丑'] ]

// var tg = ['','甲','乙','丙','丁','戊','己','庚','辛','壬','癸'];
// var dz = ['','寅','卯','辰','巳','午','未','申','酉','戌','亥','子','丑'];
// var year,month,day;
// $('.one').change(function(e) {
//     year=parseInt(e.target.value);
//     // ceYeargz({year,month,day});
//     transformNoaday({year,month,day});
// })
   
// $('.two').change(function(e) {
//     month=parseInt(e.target.value);
//     // ceYeargz({year,month,day});
//     transformNoaday({year,month,day});
   
// })
// $('.three').change(function(e) {
//     day=parseInt(e.target.value);
//     // ceYeargz({year,month,day});
//     transformNoaday({year,month,day});

// })

// const transformNoaday =({year,month,day})=>{
//  if(year!==undefined&&month!==undefined&&day!==undefined){
// 	  alert(year+'-'+month+'-'+day);
// 	  getDate();
// }

// function getDate(){
//     year  = parseInt($('.one').val());
//     month = parseInt($('.two').val());
//     date  = parseInt($('.three').val()); 
//    if(year!==undefined&&month!==undefined&&day!==undefined){
//       var text = getLunar({year,month,date});
//       alert(text);
//       var yeargz1 = text.slice(0,2);
//       var yearTg  = text.slice(0,1);
//       var index = tg.indexOf(yearTg);
//       var num = index*2+12;
//       var monthTgIndex = num-Math.floor(num/10)*10; 
//       alert(yeargz1+num);
//       alert(monthTgIndex);
//       var monthTg = tg[monthTgIndex];
//       alert(monthTg);
//       var monthDz = dz[12];
//       alert(monthDz);
//       var monthTD = tg[monthTgIndex]+dz[12];
//       alert(monthTD) 
//       var noamonth = text.slice(4, 5);
//       alert(noamonth);
//    }
// };

//  const ceMonthgz = ({index,year,month,date}) =>{
//         switch(year){
//              case 1900:

//              break;
//              case 1901:

//              break;
//              case 1902:

//              break;
//              case 1903:

//              break;
//              case 1904:

//              break;
//              case 1905:

//              break;
//              case 1906:

//              break;
//              case 1907:

//              break;
//              case 1908:

//              break;
//              case 1909:

//              break;
//              case 1910:

//              break;
//              case 1911:

//              break;
//              case 1912:

//              break;
//              case 1913:

//              break;
//              case 1914:

//              break;
//              case 1915:

//              break;
//              case 1916:

//              break;
//              case 1917:

//              break;
//              case 1918:

//              break;
//              case 1919:

//              break;
//              case 1920:

//              break;
//              case 1921:

//              break;
//              case 1922:

//              break;
//              case 1923:

//              break;
//              case 1924:

//              break;
//              case 1925:

//              break;
//              case 1926:

//              break;
//              case 1927:

//              break;
//              case 1928:

//              break;
//              case 1929:

//              break;
//              case 1930:

//              break;
//              case 1931:

//              break;
//              case 1932:

//              break;
//              case 1933:

//              break;
//              case 1934:

//              break;
//              case 1935:

//              break;
//              case 1936:

//              break;
//              case 1937:

//              break;
//              case 1938:

//              break;
//              case 1939:

//              break;
//              case 1940:

//              break;
//              case 1941:

//              break;
//              case 1942:

//              break;
//              case 1943:

//              break;
//              case 1944:

//              break;
//              case 1945:

//              break;
//              case 1946:

//              break;
//              case 1947:

//              break;
//              case 1948:

//              break;
//              case 1949:

//              break;
//              case 1950:

//              break;
//              case 1951:

//              break;
//              case 1952:

//              break;
//              case 1953:

//              break;
//              case 1954:

//              break;
//              case 1955:

//              break;
//              case 1956:

//              break;
//              case 1957:

//              break;
//              case 1958:

//              break;
//              case 1959:

//              break;
//              case 1960:

//              break;
//              case 1961:

//              break;
//              case 1962:

//              break;
//              case 1963:

//              break;
//              case 1964:

//              break;
//              case 1965:

//              break;
//              case 1966:

//              break;
//              case 1967:

//              break;
//              case 1968:

//              break;
//              case 1969:

//              break;
//              case 1970:

//              break;
//              case 1971:

//              break;
//              case 1972:

//              break;
//              case 1973:

//              break;
//              case 1974:

//              break;
//              case 1975:

//              break;
//              case 1976:

//              break;
//              case 1977:

//              break;
//              case 1978:

//              break;
//              case 1979:

//              break;
//              case 1980:

//              break;
//              case 1981:

//              break;
//              case 1982:

//              break;
//              case 1983:

//              break;
//              case 1984:

//              break;
//              case 1985:

//              break;
//              case 1986:

//              break;
//              case 1987:

//              break;
//              case 1988:

//              break;
//              case 1989:

//              break;
//              case 1990:
//                if(month===1&&date>=5){
               	 
//                   monthTg 
//                }
//              break;
//              case 1991:

//              break;
//              case 1992:

//              break;
//              case 1993:

//              break;
//              case 1994:

//              break;
//              case 1995:

//              break;
//              case 1996:

//              break;
//              case 1997:

//              break;
//              case 1998:

//              break;
//              case 1999:

//              break;
//              case 2000:

//              break;
//              case 2001:

//              break;
//              case 2002:

//              break;
//              case 2003:

//              break;
//              case 2004:

//              break;
//              case 2005:

//              break;
//              case 2006:

//              break;
//              case 2007:

//              break;
//              case 2008:

//              break;
//              case 2009:

//              break;
//              case 2010:

//              break;
//              case 2011:

//              break;
//              case 2012:

//              break; 
//              case 2013:

//              break;
//              case 2014:

//              break;
//              case 2015:

//              break;
//              case 2016:

//              break;
//              case 2017:

//              break;
//              case 2018:

//              break;
//              case 2019:

//              break;
//              case 2020:

//              break;
//              case 2021:

//              break;
//              case 2022:

//              break;
//              case 2023:

//              break;
//              case 2024:

//              break;
//              case 2025:

//              break; 
//              case 2026:

//              break;
//              case 2027:

//              break;
//              case 2028:

//              break;
//              case 2029:

//              break;
//              case 2030:

//              break;
//              case 2031:

//              break;
//              case 2032:

//              break;
//              case 2033:

//              break;
//              case 2034:

//              break;
//              case 2035:

//              break;
//              case 2036:

//              break;
//              case 2037:

//              break;
//              case 2038:

//              break; 
//              case 2039:

//              break;
//              case 2040:

//              break;
//              case 2041:

//              break;
//              case 2042:

//              break;
//              case 2043:

//              break;
//              case 2044:

//              break;
//              case 2045:

//              break;
//              case 2046:

//              break;
//              case 2047:

//              break;
//              case 2048:

//              break;
//              case 2049:

//              break;
//              case 2050:

//              break;
             

//         }

//  }
    


// var LunarDate = {  
//                 madd: new Array(0, 31, 59, 90, 120, 151, 181, 212, 243, 273, 304, 334),  
//                 HsString: '甲乙丙丁戊己庚辛壬癸',  
//                 EbString: '子丑寅卯辰巳午未申酉戌亥',  
//                 NumString: "一二三四五六七八九十",  
//                 MonString: "正二三四五六七八九十冬腊",  
//                 CalendarData: new Array(0xA4B, 0x5164B, 0x6A5, 0x6D4, 0x415B5, 0x2B6, 0x957, 0x2092F, 0x497, 0x60C96, 0xD4A, 0xEA5, 0x50DA9, 0x5AD, 0x2B6, 0x3126E, 0x92E, 0x7192D, 0xC95, 0xD4A, 0x61B4A, 0xB55, 0x56A, 0x4155B, 0x25D, 0x92D, 0x2192B, 0xA95, 0x71695, 0x6CA, 0xB55, 0x50AB5, 0x4DA, 0xA5B, 0x30A57, 0x52B, 0x8152A, 0xE95, 0x6AA, 0x615AA, 0xAB5, 0x4B6, 0x414AE, 0xA57, 0x526, 0x31D26, 0xD95, 0x70B55, 0x56A, 0x96D, 0x5095D, 0x4AD, 0xA4D, 0x41A4D, 0xD25, 0x81AA5, 0xB54, 0xB6A, 0x612DA, 0x95B, 0x49B, 0x41497, 0xA4B, 0xA164B, 0x6A5, 0x6D4, 0x615B4, 0xAB6, 0x957, 0x5092F, 0x497, 0x64B, 0x30D4A, 0xEA5, 0x80D65, 0x5AC, 0xAB6, 0x5126D, 0x92E, 0xC96, 0x41A95, 0xD4A, 0xDA5, 0x20B55, 0x56A, 0x7155B, 0x25D, 0x92D, 0x5192B, 0xA95, 0xB4A, 0x416AA, 0xAD5, 0x90AB5, 0x4BA, 0xA5B, 0x60A57, 0x52B, 0xA93, 0x40E95),  
//                 Year: null,  
//                 Month: null,  
//                 Day: null,  
//                 TheDate: null,  
//                 GetBit: function(m, n){  
//                         return (m >> n) & 1;  
//                 },  
//                 e2c: function(){  
//                         this.TheDate = (arguments.length != 3) ? new Date(): new Date(arguments[0], arguments[1], arguments[2]);  
//                         var total, m, n, k;  
//                         var isEnd = false;  
//                         var tmp = this.TheDate.getFullYear();  
//                         total = (tmp - 1921) * 365 + Math.floor((tmp - 1921) / 4) + this.madd[this.TheDate.getMonth()] + this.TheDate.getDate() - 38;  
//                         if (this.TheDate.getYear() % 4 == 0 && this.TheDate.getMonth() > 1) {  
//                                 total++;  
//                         }  
//                         for (m = 0; ; m++) {  
//                                 k = (this.CalendarData[m] < 0xfff) ? 11: 12;  
//                                 for (n = k; n >= 0; n--) {  
//                                         if (total <= 29 + this.GetBit(this.CalendarData[m], n)) {  
//                                                 isEnd = true;  
//                                                 break;  
//                                         }  
//                                         total = total - 29 - this.GetBit(this.CalendarData[m], n);  
//                                 }  
//                                 if (isEnd)  
//                                         break;  
//                         }  
//                         this.Year = 1921 + m;  
//                         this.Month = k - n + 1;  
//                         this.Day = total;  
//                         if (k == 12) {  
//                                 if (this.Month == Math.floor(this.CalendarData[m] / 0x10000) + 1) {  
//                                         this.Month = 1 - this.Month;  
//                                 }  
//                                 if (this.Month > Math.floor(this.CalendarData[m] / 0x10000) + 1) {  
//                                         this.Month--;  
//                                 }  
//                         }  
//                 },  
//                 GetcDateString: function(){  
//                         var tmp = "";  
//                         tmp += this.HsString.charAt((this.Year - 4) % 10);  
//                         tmp += this.EbString.charAt((this.Year - 4) % 12);  
//                         tmp += "年 ";  
//                         if (this.Month < 1) {  
//                                 tmp += "(闰)";  
//                                 tmp += this.MonString.charAt(-this.Month - 1);  
//                         } else {  
//                                 tmp += this.MonString.charAt(this.Month - 1);  
//                         }  
//                         tmp += "月";  
//                         tmp += (this.Day < 11) ? "初": ((this.Day < 20) ? "十": ((this.Day < 30) ? "廿": "三十"));  
//                         if (this.Day % 10 != 0 || this.Day == 10) {  
//                                 tmp += this.NumString.charAt((this.Day - 1) % 10);  
//                         }  
//                         return tmp;  
//                 },  
//                 GetLunarDay: function(solarYear, solarMonth, solarDay) {  
//                         if (solarYear < 1921 || solarYear > 2020) {  
//                                 return "";  
//                         } else {  
//                                 solarMonth = (parseInt(solarMonth) > 0) ? (solarMonth - 1): 11;  
//                                 this.e2c(solarYear, solarMonth, solarDay);  
//                                 return this.GetcDateString();  
//                         }  
//                 }  
// };

// const  getLunar = ({year,month,date}) =>{
//     var text= LunarDate.GetLunarDay(year,month,date);
//     return text;
// };